In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('survey_results_public.csv', index_col = 'Respondent')
schema_df = pd.read_csv('survey_results_schema.csv', index_col='Column')

In [4]:
df.shape

(88883, 84)

In [5]:
schema_df.shape

(85, 1)

In [7]:
df.head()

,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,EduOther,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,"Taught yourself a new language, framework, or ...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",Taken an online course in programming or softw...,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy

In [11]:
# filter high salary
countries = ['United States','India','United Kingdom','Germany','Canada']
filt_1 = df['Country'].isin(countries)
high_salary = (df['ConvertedComp']>70000)
df.loc[high_salary, ['Country','LanguageWorkedWith','ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
Respondent,,,
6,Canada,Java;R;SQL,366420.0
9,New Zealand,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;P...,95179.0
13,United States,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...,90000.0
16,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;T...,455352.0
22,United States,Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...,103000.0
...,...,...,...
88876,United States,Bash/Shell/PowerShell;C#;HTML/CSS;Java;Python;...,180000.0
88877,United States,Bash/Shell/PowerShell;C;Clojure;HTML/CSS;Java;...,2000000.0
88878,United States,HTML/CSS;JavaScript;Scala;TypeScript,130000.0
88879,Finland,Bash/Shell/PowerShell;C++;Python,82488.0
88882,Netherlands,C#;HTML/CSS;Java;JavaScript;PHP;Python,588012.0

In [12]:
df.columns

Index(['MainBranch', 'Hobbyist', 'OpenSourcer', 'OpenSource', 'Employment',
       'Country', 'Student', 'EdLevel', 'UndergradMajor', 'EduOther',
       'OrgSize', 'DevType', 'YearsCode', 'Age1stCode', 'YearsCodePro',
       'CareerSat', 'JobSat', 'MgrIdiot', 'MgrMoney', 'MgrWant', 'JobSeek',
       'LastHireDate', 'LastInt', 'FizzBuzz', 'JobFactors', 'ResumeUpdate',
       'CurrencySymbol', 'CurrencyDesc', 'CompTotal', 'CompFreq',
       'ConvertedComp', 'WorkWeekHrs', 'WorkPlan', 'WorkChallenge',
       'WorkRemote', 'WorkLoc', 'ImpSyn', 'CodeRev', 'CodeRevHrs', 'UnitTests',
       'PurchaseHow', 'PurchaseWhat', 'LanguageWorkedWith',
       'LanguageDesireNextYear', 'DatabaseWorkedWith',
       'DatabaseDesireNextYear', 'PlatformWorkedWith',
       'PlatformDesireNextYear', 'WebFrameWorkedWith',
       'WebFrameDesireNextYear', 'MiscTechWorkedWith',
       'MiscTechDesireNextYear', 'DevEnviron', 'OpSys', 'Containers',
       'BlockchainOrg', 'BlockchainIs', 'BetterLife', 'ITperson', 'OffOn',
       'SocialMedia', 'Extraversion', 'ScreenName', 'SOVisit1st',
       'SOVisitFreq', 'SOVisitTo', 'SOFindAnswer', 'SOTimeSaved',
       'SOHowMuchTime', 'SOAccount', 'SOPartFreq', 'SOJobs', 'EntTeams',
       'SOComm', 'WelcomeChange', 'SONewContent', 'Age', 'Gender', 'Trans',
       'Sexuality', 'Ethnicity', 'Dependents', 'SurveyLength', 'SurveyEase'],
      dtype='object')

In [13]:
people = {
    'first':['John','Ethan','Walter'],
    'last':['Smith','Tai','Disney'],
    'email':['john.smith@gmail.com', 'ethantai@gmail.com','walterdisney@gmail.com']
    }
daf = pd.DataFrame(people)
daf

    first    last                   email
0    John   Smith    john.smith@gmail.com
1   Ethan     Tai      ethantai@gmail.com
2  Walter  Disney  walterdisney@gmail.com

In [14]:
daf.columns = ['1st','lastname','emailaddress']  # for change all column names
daf

      1st lastname            emailaddress
0    John    Smith    john.smith@gmail.com
1   Ethan      Tai      ethantai@gmail.com
2  Walter   Disney  walterdisney@gmail.com

In [15]:
# change specific column

daf.columns = [x.upper() for x in daf.columns]
daf

      1ST LASTNAME            EMAILADDRESS
0    John    Smith    john.smith@gmail.com
1   Ethan      Tai      ethantai@gmail.com
2  Walter   Disney  walterdisney@gmail.com

In [16]:
daf.columns = daf.columns.str.replace(' ','_') # replace space with _
daf

      1ST LASTNAME            EMAILADDRESS
0    John    Smith    john.smith@gmail.com
1   Ethan      Tai      ethantai@gmail.com
2  Walter   Disney  walterdisney@gmail.com

In [18]:
daf.rename(columns={'1ST':'first','LASTNAME':'last'},inplace=True) #specify old and new column's name
daf

    first    last            EMAILADDRESS
0    John   Smith    john.smith@gmail.com
1   Ethan     Tai      ethantai@gmail.com
2  Walter  Disney  walterdisney@gmail.com

In [19]:
daf.loc[2] =['John','Alder','johnalder@email.com'] #locate one row, change
daf

   first   last          EMAILADDRESS
0   John  Smith  john.smith@gmail.com
1  Ethan    Tai    ethantai@gmail.com
2   John  Alder   johnalder@email.com

In [22]:
daf.loc[2,['last','EMAILADDRESS']] =['Walter','Disney']
daf

   first    last          EMAILADDRESS
0   John   Smith  john.smith@gmail.com
1  Ethan     Tai    ethantai@gmail.com
2   John  Walter                Disney

In [ ]:
# loc is for changing single or a few value

In [23]:
# use filter to search

filt = (daf['EMAILADDRESS'] == 'ethantai@gmail.com')
daf[filt]

   first last        EMAILADDRESS
1  Ethan  Tai  ethantai@gmail.com

In [24]:
daf[filt]['last']

1    Tai
Name: last, dtype: object

In [25]:
daf[filt]['last'] = 'Smith'  # don't use this method, use loc/at

<ipython-input-25-214d3a22f9f7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  daf[filt]['last'] = 'Smith'

In [26]:
daf.loc[filt,'last'] = 'Smith'
daf

   first    last          EMAILADDRESS
0   John   Smith  john.smith@gmail.com
1  Ethan   Smith    ethantai@gmail.com
2   John  Walter                Disney

In [27]:
# for multiply rows

daf.columns

Index(['first', 'last', 'EMAILADDRESS'], dtype='object')

In [30]:
daf.columns = ['first','last','email']
daf

   first    last                 email
0   John   Smith  john.smith@gmail.com
1  Ethan   Smith    ethantai@gmail.com
2   John  Walter                Disney

In [31]:
daf['email'].str.upper()

0    JOHN.SMITH@GMAIL.COM
1      ETHANTAI@GMAIL.COM
2                  DISNEY
Name: email, dtype: object

In [33]:
daf['email'].str.lower() # not change the dataframe
df['email']=daf['email'].str.lower() # change the data frame

0    john.smith@gmail.com
1      ethantai@gmail.com
2                  disney
Name: email, dtype: object

In [35]:
daf['email'].apply(len) # apply method on values of a series

0    20
1    18
2     6
Name: email, dtype: int64

In [36]:
def update_email(email):
    return email.upper()

In [37]:
daf['email'].apply(update_email)  # not with (), only pass the function name

0    JOHN.SMITH@GMAIL.COM
1      ETHANTAI@GMAIL.COM
2                  DISNEY
Name: email, dtype: object

In [39]:
daf['email'] = daf['email'].apply(update_email)
daf

   first    last                 email
0   John   Smith  JOHN.SMITH@GMAIL.COM
1  Ethan   Smith    ETHANTAI@GMAIL.COM
2   John  Walter                DISNEY

In [40]:
daf['email'] = daf['email'].apply(lambda x: x.lower())
daf

   first    last                 email
0   John   Smith  john.smith@gmail.com
1  Ethan   Smith    ethantai@gmail.com
2   John  Walter                disney

In [41]:
daf.apply(len) # for dataframe, apply method on every column, here return the length of each column

first    3
last     3
email    3
dtype: int64

In [42]:
len(daf['email'])

3

In [43]:
daf.apply(len, axis='columns') #return length of each row

0    3
1    3
2    3
dtype: int64

In [44]:
# return min value of each column
daf.apply(pd.Series.min)

first     Ethan
last      Smith
email    disney
dtype: object

In [45]:
daf.apply(lambda x: x.min())

first     Ethan
last      Smith
email    disney
dtype: object

In [46]:
daf.applymap(len) #applymap will apply method on every value of the dataframe

   first  last  email
0      4     5     20
1      5     5     18
2      4     6      6

In [47]:
daf.applymap(str.lower)

   first    last                 email
0   john   smith  john.smith@gmail.com
1  ethan   smith    ethantai@gmail.com
2   john  walter                disney

In [51]:
daf['first'].map({'John':'May','Ethan':'Ti'}) # map wii change some values of a series

0    May
1     Ti
2    May
Name: first, dtype: object

In [52]:
daf['first'].replace({'John':'May','Ethan':'Ti'}) # unchanged value will remain the same

0    May
1     Ti
2    May
Name: first, dtype: object

In [53]:
daf

   first    last                 email
0   John   Smith  john.smith@gmail.com
1  Ethan   Smith    ethantai@gmail.com
2   John  Walter                disney

In [54]:
# add a new column
daf['first']+' '+daf['last']

0     John Smith
1    Ethan Smith
2    John Walter
dtype: object

In [55]:
daf['full name'] = daf['first']+' '+daf['last'] # use [] to tell a new column
daf

   first    last                 email    full name
0   John   Smith  john.smith@gmail.com   John Smith
1  Ethan   Smith    ethantai@gmail.com  Ethan Smith
2   John  Walter                disney  John Walter

In [57]:
daf.drop(columns=['first','last']) # not change original dataframe

                  email    full name
0  john.smith@gmail.com   John Smith
1    ethantai@gmail.com  Ethan Smith
2                disney  John Walter

In [58]:
daf.drop(columns=['first','last'],inplace=True)
daf

                  email    full name
0  john.smith@gmail.com   John Smith
1    ethantai@gmail.com  Ethan Smith
2                disney  John Walter

In [64]:
# add new columns by full name

daf['full name'].apply(str.split)

0     [John, Smith]
1    [Ethan, Smith]
2    [John, Walter]
Name: full name, dtype: object

In [65]:
daf['full name'].str.split(' ')

0     [John, Smith]
1    [Ethan, Smith]
2    [John, Walter]
Name: full name, dtype: object

In [66]:
daf['full name'].str.split(' ',expand=True)

       0       1
0   John   Smith
1  Ethan   Smith
2   John  Walter

In [67]:
daf[['first','last']] = daf['full name'].str.split(' ',expand=True)

In [68]:
daf

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
2                disney  John Walter   John  Walter

In [69]:
# add rows, combine rows
daf.append({'first':'tony'},ignore_index=True)

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
2                disney  John Walter   John  Walter
3                   NaN          NaN   tony     NaN

In [70]:
daf

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
2                disney  John Walter   John  Walter

In [ ]:
# insert more rows of data, same columns
daf.append(df2, ignore_index=True, sort=False) #add to the end of the table
# no inplace for this method, to save as a new dataframe
daf = daf.append(df2, ignore_index=True, sort=False)
daf.drop(index=4) #delete the 4 index

In [71]:
daf.sort_values(by='first')

                  email    full name  first    last
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
0  john.smith@gmail.com   John Smith   John   Smith
2                disney  John Walter   John  Walter

In [72]:
daf.sort_values(by='first',ascending=False)

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
2                disney  John Walter   John  Walter
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith

In [74]:
daf.sort_values(by=['first','last']) # first sort by first name, if same, sort by last name

                  email    full name  first    last
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
0  john.smith@gmail.com   John Smith   John   Smith
2                disney  John Walter   John  Walter

In [75]:
daf.sort_values(by=['first','last'], ascending=[False, True]) #descending by first, if the same first, use last: ascending

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
2                disney  John Walter   John  Walter
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith

In [76]:
daf.sort_index()

                  email    full name  first    last
0  john.smith@gmail.com   John Smith   John   Smith
1    ethantai@gmail.com  Ethan Smith  Ethan   Smith
2                disney  John Walter   John  Walter

In [77]:
daf['last'].sort_values()

0     Smith
1     Smith
2    Walter
Name: last, dtype: object

In [ ]:
# Let's print the first entries  
# in all the groups formed.  
gk.first()